#include <stdio.h>
int main()
{
    int a = 1, b = 2, c = 3;
    printf("\e[2J");            // 清屏
    printf("\e[10;5H光标定位"); // 移动光标到第10行第5列
    printf("\033[1;32m%5ld\e[0m \x1b[4;34m%5ld\e[0m \x1b[5;37m%5ld\e[0m\n", a, b, c);
    printf("\e[2;1H光标定位"); // 移动光标到第2行第1列
    a = 10, b = 24, c = 33;
    printf("\x1b[93m%5ld \x1b[95m%5ld \x1b[96m%5ld\n", a, b, c);
    printf("\e[0m");

    char *s = "\033[1m	设置高亮度\
\033[4m	下划线\
\033[5m	闪烁\
\033[7m	反显\
\033[8m	消隐\
\033[30m – \033[37m	设置前景色\
\033[40m – \033[47m	设置背景色\
\033[nA	光标上移n行\
\033[nB	光标下移n行\
\033[nC	光标右移n行\
\033[nD	光标左移n行\
\033[y; xH	设置光标位置\
\033[2J	清屏\
\033[K	清除从光标到行尾的内容\
\033[s	保存光标位置\
\033[u	恢复光标位置\
\033[?25l	隐藏光标\
\033[?25h	显示光标\
\033[0m	关闭所有属性";
    //printf("%s", s);
    return 0;
}
